/*
 * Copyright (c) Kandou-AI.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef _KB_REGLI_H
#define _KB_REGLI_H

#include <assert.h> // For static_assert

#include "kb900x_eeprom.h"
#include "kb900x_i2c_comm.h"
#include "kb900x_smbus_comm.h"

// Constants
#define KB900X_REGLI_REGISTER_ADDR_SIZE (4)
#define KB900X_REGLI_REGISTER_SIZE (4)
#define KB900X_SMBUS_REGISTER_ADDR_SIZE (2)
#define KB900X_SMBUS_REGISTER_SIZE (4)
#define KB900X_LINK_STATUS_TIMEOUT (500) // FIXME magic number - How much do we have to wait?
#define KB900X_SIZEOF_SW_SHARED_DATA                                                               \
    (0x400 * 4) // NOTE: MUST be a multiple of 4, because we can only read in 4B chunks
#define KB9003_NUM_TILES (4)
#define KB900X_NUM_RPCS (8)
#define KB900X_NUM_RPCS_EVENTS (128)
#define KB9003_NUM_LANES (16)
#define KB9003_MAX_NUM_LINKS (8)
#define KB900X_DCCM_END_ADDR_A0 (0x80008000)
#define KB900X_DCCM_END_ADDR_B0_B1 (0x80010000)

    STATE(F_LB_SPEED_DONE)                                                                         \
    STATE(F_LB_DIR)                                                                                \
    STATE(F_COMPL_ENTRY)                                                                           \
    STATE(F_COMPL_LOCK)                                                                            \
    STATE(F_COMPL_PTRN)                                                                            \
    STATE(F_COMPL_EXT)                                                                             \
    STATE(E_CLB_ENTRY)                                                                             \
    STATE(E_CLB_CHG_DR)                                                                            \
    STATE(E_CLB_PTRN)                                                                              \
    STATE(E_CLB_EXT)                                                                               \
    STATE(NA_1)                                                                                    \
    STATE(NA_2)                                                                                    \
    STATE(NA_3)                                                                                    \
    STATE(NA_4)                                                                                    \
    STATE(NA_5)                                                                                    \
    STATE(STATE_COUNT)

// Enums
// Revision ID
typedef enum {
    KB900X_REVID_A0 = 0x00000000,
    KB900X_REVID_B0 = 0x00000010,
    KB900X_REVID_B1 = 0x00000011,
} kb900x_revid_t;

// Mailbox status constants
typedef enum {
    /** status_not set */
    KB900X_FEAT_REQ_STATUS_NOT_SET = 0,
    /** Request succeeded */
    KB900X_FEAT_REQ_STATUS_SUCCESS = 1,
    /** Request in progress */
    KB900X_FEAT_REQ_STATUS_IN_PROGRESS = 2,
    /** Request failed */
    KB900X_FEAT_REQ_STATUS_FAILURE = 3,
} kb900x_feature_req_status_t;

// NOTE: these comments are used to denote what must be included in the headerfile for the CFFI
//! CFFI
// Communication modes
typedef enum {
    KB900X_COMM_SMBUS = 0,
    KB900X_COMM_TWI = 1,
    KB900X_COMM_BIC = 2,
} kb900x_communication_mode_t;
// NOTE: these comments are used to denote what must be included in the headerfile for the CFFI
//! CFFI END

// Boot Status
typedef enum {
    KB900X_UNKNOWN = 0,
    KB900X_BOOT_ROM = 1,
    KB900X_SBL = 2,
    KB900X_FW = 3
} kb900x_boot_entity_t;

typedef enum {
    KB900X_STATE_INIT = 0,
    KB900X_STATE_READY = 1,
    KB900X_STATE_ERROR = 2,
} kb900x_boot_status_t;

// RTSSM states
enum KB900X_RTSSM_STATES { KB900X_FOREACH_STATE(KB900X_GENERATE_ENUM) };

// PCIe gen
enum KB900X_PCIE_GEN { KB900X_FOREACH_GEN(KB900X_GENERATE_ENUM) };

// Types
/**
 * \brief This struct is used to hold the firmware version (kb900x_get_firmware_version)
 *
 * The format of the FW version is :
 * major.minor.patch.suffix
 *
 */
typedef union {
    struct {
        /** Major version (int) */
        uint8_t major;
        /** Minor version (int) */
        uint8_t minor;
        /** Patch (int) */
        uint8_t patch;
        /** Suffix (int) */
        uint8_t suffix;
    };
    uint32_t raw;
} kb900x_fw_version_t;
static_assert(sizeof(kb900x_fw_version_t) == sizeof(uint32_t),
              "kb900x_fw_version_t size mismatch!");

/**
 * \brief This struct is used to hold the firmware health (kb900x_get_firmware_health)
 */
typedef union {
    struct {
        /* liveliness counter */
        uint32_t liveliness : 4;
        /* unused */
        uint32_t : 27;
        /* Firmware is initialized */
        uint32_t fw_is_initialized : 1;
    };
    uint32_t raw;
} kb900x_fw_health_t;
static_assert(sizeof(kb900x_fw_health_t) == sizeof(uint32_t), "kb900x_fw_health_t size mismatch!");

/**
 * \brief This struct is used to hold the status of a link (kb900x_get_link_status)
 */
typedef union {
    struct {
        uint32_t link_invalid : 1;
        uint32_t l0_reached : 1;
        uint32_t link_number : 9;
        uint32_t rtssm_state : 5;
        uint32_t rtssm_speed : 3;
        uint32_t link_width : 5;
        /* unused */
        uint32_t : 8;
    };
    uint32_t raw;
} ALIGN_PACKED(4) kb900x_link_status_t;
static_assert(sizeof(kb900x_link_status_t) == sizeof(uint32_t),
              "kb900x_link_status_t size mismatch!");

/**
 * \brief This struct stores a register address and value tuple, for register dumps.
 */
typedef struct {
    uint32_t address;
    uint32_t value;
} ALIGN_PACKED(4) kb900x_register_record_t;
static_assert(sizeof(kb900x_register_record_t) == 2 * sizeof(uint32_t),
              "kb900x_link_status_t size mismatch!");

/**
 * \brief This struct is used to hold the register dump (kb900x_get_register_dump)
 *
 * It contains a list of register records, the number of records and a name.
 */
typedef struct {
    /** The number of records in this dump */
    uint32_t num_records;
    /** The register records */
    kb900x_register_record_t *records;
} ALIGN_PACKED(4) kb900x_register_dump_t;

/**
 * \brief Encode a range of register addresses to dump.
 */
typedef struct {
    /** The base address of this range. */
    uint32_t base_address;
    /** The number of registers in this range. */
    uint32_t num_registers;
} kb900x_register_range_t;

/**
 * \brief The preset config structure
 */
typedef struct {
    /** The lane ID in range 0 to 15*/
    uint8_t lane_id;
    /** The data rate in range 0 to 4 (PCIe Gen 5 = 4, PCIe Gen4 = 3, ...)*/
    uint8_t data_rate;
    /** Unused */
    uint16_t pad;
} ALIGN_PACKED(4) kb900x_preset_config_t;
static_assert(sizeof(kb900x_preset_config_t) == sizeof(uint32_t),
              "kb900x_preset_config_t size mismatch!");

/**
 * \brief The preset config structure
 *
 * It contains the different requested presets.
 */
typedef struct {
    /** Local upstream preset (retimer -> root complex) in range 0 to 10 */
    uint8_t rt_rc;
    /** Local downstream preset (retimer -> endpoint) in range 0 to 10 */
    uint8_t rt_ep;
    /** Partner upstream preset (root compex -> retimer) in range 0 to 10 */
    uint8_t rc_rt;
    /** Partner downstream preset (endpoint -> retimer) in range 0 to 10 */
    uint8_t ep_rt;
} ALIGN_PACKED(4) kb900x_preset_data_t;
static_assert(sizeof(kb900x_preset_data_t) == sizeof(uint32_t),
              "kb900x_preset_data_t size mismatch!");

/**
 * \brief The presets for a single lane structure
 */
typedef struct {
    kb900x_preset_config_t config; // preset config
    kb900x_preset_data_t data;     // config info
} ALIGN_PACKED(4) kb900x_presets_t;
static_assert(sizeof(kb900x_presets_t) == 2 * sizeof(uint32_t), "kb900x_presets_t size mismatch!");

/**
 * \brief The presets for all lanes structure
 */
typedef struct {
    kb900x_presets_t lanes[KB9003_NUM_LANES];
} ALIGN_PACKED(4) kb900x_all_presets_t;
static_assert(sizeof(kb900x_all_presets_t) == 32 * sizeof(uint32_t),
              "kb900x_all_presets_t size mismatch!");

/**
 * \brief Type representing a single entry in a log.
 *
 * \note The delta parameter must be interpreted using the delta_to_ms function.
 */
typedef union {
    struct {
        /** The RTSSM state */
        uint16_t rtssm : 6;
        /** The data rate in range 0 to 4 (invalid =7, PCIe Gen 5 = 4, PCIe Gen4 = 3, ...)*/
        uint16_t data_rate : 3;
        /** The time delta */
        uint16_t delta : 7;
    };
    uint16_t raw;
} ALIGN_PACKED(2) kb900x_rtssm_entry_t;
static_assert(sizeof(kb900x_rtssm_entry_t) == sizeof(uint16_t),
              "kb900x_rtssm_entry_t size mismatch!");

/**
 * \brief Type representing a log map info.
 */
typedef union {
    struct {
        /** The tile ID */
        uint32_t tile_id : 8;
        /** The RPCS ID */
        uint32_t rpcs_id : 8;
        /** The RTSSM config ID */
        uint32_t rtssm_cfg_id : 8;
        /** The current position */
        uint32_t curr_pos : 4;
        /** The era */
        uint32_t era : 4;
    };
    uint32_t raw;
} ALIGN_PACKED(4) kb900x_rtssm_log_map_info_t;
static_assert(sizeof(kb900x_rtssm_log_map_info_t) == sizeof(uint32_t),
              "kb900x_rtssm_log_map_info_t size mismatch!");

/**
 * \brief Struct representing all RTSSM entries of a single RPCS
 */
typedef struct {
    kb900x_rtssm_log_map_info_t log_map_info;
    kb900x_rtssm_entry_t entries[32];
} ALIGN_PACKED(4) kb900x_rtssm_log_t;
static_assert(sizeof(kb900x_rtssm_log_t) == 17 * sizeof(uint32_t),
              "kb900x_rtssm_log_t size mismatch!");

/**
 * \brief Struct representing all the RTSSM logs on a device
 */
typedef struct {
    kb900x_rtssm_log_t logs[8]; // indexed log contents (some may be empty)
} ALIGN_PACKED(4) kb900x_hw_rtssm_logs_t;
static_assert(sizeof(kb900x_hw_rtssm_logs_t) == 8 * 17 * sizeof(uint32_t),
              "kb900x_hw_rtssm_logs_t size mismatch!");

/**
 * \brief Struct representing all the FOM (figure of merit) values on a device
 *
 * \note The FOM values are only available from PCIe gen4
 */
typedef struct {
    /** Startup FOM on side A RX | B TX */
    uint8_t startup_a_rx[16];
    /** Mission mode FOM on side A RX | B TX */
    uint8_t mm_a_rx[16];
    /** Startup FOM on side A TX | B RX */
    uint8_t startup_b_rx[16];
    /** Mission mode FOM on side A TX | B RX */
    uint8_t mm_b_rx[16];
} ALIGN_PACKED(4) kb900x_fom_t;
static_assert(sizeof(kb900x_fom_t) == 16 * sizeof(uint32_t), "kb900x_fom_t size mismatch!");

/**
 * \brief Struct used to map a lane to HW block IDs
 */
typedef struct {
    /** The tile ID */
    uint8_t tile_id;
    /** The phy ID */
    uint8_t phy_id;
    /** The lane ID within the phy */
    uint8_t phy_lane_id;
    /** The RPCS ID */
    uint8_t rpcs_id;
} ALIGN_PACKED(4) kb900x_lane_mapping_t;

/**
 * \brief Struct used to map the sides and lanes to HW block IDs
 */
typedef struct {
    /** Side A RX | B TX */
    kb900x_lane_mapping_t a_rx[16];
    /** Side A TX | B RX */
    kb900x_lane_mapping_t b_rx[16];
} ALIGN_PACKED(4) kb9003_mapping_t;

/**
 * \brief Struct containing the phy info for a single phy
 */
typedef struct {
    /** RX_ATT */
    uint32_t rx_att;
    /** RX_CTLE */
    uint32_t rx_ctle;
    /** RX_VGA */
    uint32_t rx_vga;
    /** AFE_RTRIM */
    uint32_t afe_rtrim;
    /** RX_AFE_RATE */
    uint32_t rx_afe_rate;
    /** RX_AFE_CONFIG */
    uint32_t rx_afe_config;
    /** RX_DFE_TAP */
    uint32_t rx_dfe_taps[8];
    /** RX_DFE_FLOAT_TAP */
    uint32_t rx_dfe_float_taps[4];
    /** RX_DFE_FLOAT_TAP_POS */
    uint32_t rx_dfe_float_tap_pos;
    /** RX_DPLL_FREQ */
    uint32_t rx_dpll_freq;
    /** TX_ASIC_IN_1 */
    uint32_t tx_asic_in_1;
    /** TX_ASIC_IN_2 */
    uint32_t tx_asic_in_2;
    /** RX_STARTUP_FOM */
    uint32_t rx_startup_fom;
    /** RX_MM_FOM */
    uint32_t rx_mm_fom;
} ALIGN_PACKED(4) kb9003_single_phy_info_t;

/**
 * \brief Struct containing the phy info (all lanes)
 */
typedef struct {
    /** Side A RX | B TX */
    kb9003_single_phy_info_t a_rx[16];
    /** Side A TX | B RX */
    kb9003_single_phy_info_t b_rx[16];
} ALIGN_PACKED(4) kb9003_phy_info_t;
static_assert(sizeof(kb9003_phy_info_t) == 32 * sizeof(kb9003_single_phy_info_t),
              "kb9003_phy_info_t size mismatch!");

/**
 * \brief Struct containing a single SW RTSSM entry
 */
typedef struct {
    uint32_t curr_state : 6;
    uint32_t prev_state : 6;
    uint32_t prev_prev_state : 6;
    uint32_t speed : 3;
    uint32_t rpcs_id : 3;
    uint32_t is_valid : 1;
    uint32_t : 7;
    uint32_t timestamp;
} ALIGN_PACKED(4) kb900x_sw_rtssm_entry_t;
static_assert(sizeof(kb900x_sw_rtssm_entry_t) == sizeof(uint64_t),
              "kb900x_sw_rtssm_entry_t size mismatch!");

/**
 * \brief Struct containing the SW RTSSM log
 */
typedef struct {
    kb900x_sw_rtssm_entry_t entries[KB900X_SW_RTSSM_SIZE];
} ALIGN_PACKED(4) kb900x_sw_rtssm_logs_t;
static_assert(sizeof(kb900x_sw_rtssm_logs_t) == KB900X_SW_RTSSM_SIZE * sizeof(uint64_t),
              "kb900x_sw_rtssm_log_t size mismatch!");

/**
 * \brief Struct to hold an entry of the RPCS debug counter
 */
typedef struct {
    uint8_t tile_id;
    uint8_t rpcs_id;
    uint8_t event_code;
    uint8_t _;
    uint32_t value;
} ALIGN_PACKED(4) kb900x_rpcs_debug_counter_entry_t;
static_assert(sizeof(kb900x_rpcs_debug_counter_entry_t) == 2 * sizeof(uint32_t),
              "kb900x_rpcs_debug_counter_t size mismatch!");

/**
 * \brief Struct to hold the RPCS debug counter informations
 */
typedef struct {
    kb900x_rpcs_debug_counter_entry_t
        entries[KB900X_NUM_RPCS * KB9003_NUM_TILES * KB900X_NUM_RPCS_EVENTS];
} ALIGN_PACKED(4) kb900x_rpcs_debug_counter_t;
static_assert(sizeof(kb900x_rpcs_debug_counter_t) == KB900X_NUM_RPCS * KB9003_NUM_TILES *
                                                         KB900X_NUM_RPCS_EVENTS *
                                                         sizeof(kb900x_rpcs_debug_counter_entry_t),
              "kb900x_rpcs_debug_counter_t size mismatch!");

// Type and struct to inject different read/write methods (SMBus, raw I2C, mocked for unit tests)
typedef int (*KB900X_WRITE_OPERATION)(const kb900x_config_t *config, const uint32_t address,
                                      const uint8_t address_size, const uint32_t value);
